## 클로저가 변소 스코프와 상호 작용하는 방법을 알자
숫자 리스트를 정렬할 때 특정 그룹의 숫자들이 먼저 오도록 우선순위를 매기는 예시이다
사용자 인터페이스를 표현하거나 다른 것보다 중요한 메시지나 예외 이벤트를 먼저보여줄 때 유용하다
일반적인 방법으로 sort메서드에 헬퍼 함수를 key인수로 넘기는 방법이다.
헬퍼는 주어진 아이템이 속한 그룹을 확인하고 그에 따라 정렬 키를 다르게 할 수 있다.

```
def sort_priority(values, group):
    def helper(x):
        If x in group:
            return (0, x)
        return (1,x)
    values.sort(key=helper)

numbers = [8, 3, 1, 2, 5, 4, 7, 6]
group = {2, 3, 5, 7}
sort_priority(numbers, group)
print(numbers)
>>>
[2, 3, 5, 7, 1, 4, 6, 8]
```
이와 같이 동작하는데는 세가지 원리가 있다.
    - 파이썬은 클로저(closure)를 지원한다. 클로저는 자신이 정의된 스코프의 변수에 접근할 수 있다.
    - 함수는 파이썬에서 일급 객체(first class object)이다.
      - 즉 함수를 직접 참조하고, 변수에 할당하고, 다른 함수의 인수로 전달하고, 표현식과 if 문 등에서 비교할 수 있다는 의미이다.
      - 이로 인해서 sort 메서드에서 클로저 함수를 key 인수로 받을 수 있다.
    - 파이썬에는 튜플을 비교할 때, index 0 에서 1차 정렬, index 1에서 2차 정렬, ... 이 이루어지는 특징이 있다.
코드를 조금 수정하여 상위 그룹에 포함된 값이 있는지 확인하는 기능을 추가해보자

```
def sort_priority2(values, group):
    found = False
    def helper(x):
        If x in group:
            found = True
            return (0, x)
        return (1,x)
    values.sort(key=helper)
    return found
```
될것같아 보일 수 있지만 안된다. 이유는 스코프의 권한 문제이다. 
표현식에서 변수를 참조할 때 파이썬 인터프리터는 참조를 해결하려고 다음과 같은 순서로 스코프를 탐색한다
    - 현재 함수의 스코프
    - 현재 스코프를 담고 있는 스코프
    - 코드를 포함하고 있는 모듈의 스코프(전역 스코프)
    - (len이나 str 같은 함수를 담고 있는)내장 스코프
    - 모든 곳에 없을 때 NameError가 발생한다.
변수에 값을 할당할 때 몇가지 패턴이 있다.
    - 변수가 현재 스코프에 이미 있을 때 값을 새로 할당한다.
    - 기존에 없을 경우 새로운 변수의 정의로 취급하고 그 할당을 포함하는 과정이다.
    - 개인적으로 이것을 해결할 때에는 마찬가지로 튜플로 해결하면 될거같은데 귀찮아보인다.
